In [30]:
import pandas as pd
import numpy as np

In [5]:
#task 1
d = {'type': ['A', 'A', 'B', 'B'], 'value': [10, 14, 12, 23]}
my_data = pd.DataFrame(data=d)
my_data

  type  value
0    A     10
1    A     14
2    B     12
3    B     23

In [14]:
#task 2
my_stat = pd.read_csv('my_stat.csv')

In [18]:
subset_1 = my_stat.iloc[:10, [0, 2]]
subset_1

   V1 V3
0   2  B
1  -1  B
2   0  A
3   2  A
4   0  B
5   2  A
6   0  A
7   1  A
8   0  B
9  -1  A

In [23]:
subset_2 = my_stat.drop([0, 4]).iloc[:, [1, 3]]
subset_2

       V2   V4
1     7.0  1.0
2    11.0  0.0
3    11.0  2.0
5    11.0  0.0
6     9.0  2.0
..    ...  ...
495   8.0 -1.0
496   8.0  1.0
497  11.0  2.0
498  11.0  2.0
499   8.0  1.0

[498 rows x 2 columns]

In [26]:
#task 3
subset_1 = my_stat.query('V1 > 0 & V3 == "A"')
subset_1

     V1    V2 V3   V4
3     2  11.0  A  2.0
5     2  11.0  A  0.0
7     1   9.0  A  1.0
10    1  10.0  A  1.0
13    1  12.0  A  3.0
..   ..   ... ..  ...
491   4   7.0  A  2.0
494   1  11.0  A  1.0
495   1   8.0  A -1.0
496   3   8.0  A  1.0
498   1  11.0  A  2.0

[88 rows x 4 columns]

In [27]:
subset_2 = my_stat.query('V2 != 10 | V4 >= 1')
subset_2

     V1    V2 V3   V4
0     2  13.0  B  1.0
1    -1   7.0  B  1.0
2     0  11.0  A  0.0
3     2  11.0  A  2.0
5     2  11.0  A  0.0
..   ..   ... ..  ...
495   1   8.0  A -1.0
496   3   8.0  A  1.0
497  -1  11.0  B  2.0
498   1  11.0  A  2.0
499   0   8.0  B  1.0

[447 rows x 4 columns]

In [36]:
#task 4
my_stat['V5'] = my_stat.V1 + my_stat.V4
mystat = my_stat.assign(V6 = np.log(my_stat.V2))
my_stat

     V1    V2 V3   V4   V5        V6
0     2  13.0  B  1.0  3.0  1.098612
1    -1   7.0  B  1.0  0.0      -inf
2     0  11.0  A  0.0  0.0      -inf
3     2  11.0  A  2.0  4.0  1.386294
4     0  10.0  B -1.0 -1.0       NaN
..   ..   ... ..  ...  ...       ...
495   1   8.0  A -1.0  0.0      -inf
496   3   8.0  A  1.0  4.0  1.386294
497  -1  11.0  B  2.0  1.0  0.000000
498   1  11.0  A  2.0  3.0  1.098612
499   0   8.0  B  1.0  1.0  0.000000

[500 rows x 6 columns]

In [40]:
#task 5
my_stat.rename(columns={'V1': 'session_value', 'V2': 'group', 'V3': 'time', 'V4': 'n_users'}, inplace=True)
my_stat

     session_value  group time  n_users   V5        V6
0                2   13.0    B      1.0  3.0  1.098612
1               -1    7.0    B      1.0  0.0      -inf
2                0   11.0    A      0.0  0.0      -inf
3                2   11.0    A      2.0  4.0  1.386294
4                0   10.0    B     -1.0 -1.0       NaN
..             ...    ...  ...      ...  ...       ...
495              1    8.0    A     -1.0  0.0      -inf
496              3    8.0    A      1.0  4.0  1.386294
497             -1   11.0    B      2.0  1.0  0.000000
498              1   11.0    A      2.0  3.0  1.098612
499              0    8.0    B      1.0  1.0  0.000000

[500 rows x 6 columns]

In [57]:
#task 6
my_stat_1 = pd.read_csv('my_stat_1.csv')
my_stat_1.session_value = my_stat_1.session_value.fillna(0)
my_stat_1.loc[my_stat_1.n_users < 0, 'n_users'] = my_stat_1.query('n_users >= 0').n_users.median()
my_stat_1

   session_value  time group  n_users
0            0.0    12     B      9.0
1            0.0    11     A      5.0
2            1.0     8     A      1.0
3            2.0     9     B      3.0
4            2.0    10     B      9.0
5            3.0     8     A      8.0
6            0.0    11     B      5.0
7            0.0     9     A      4.0
8            0.0     8     B      5.0
9            0.0     9     A      5.0

In [69]:
mean_session_value_data = my_stat_1.groupby('group', as_index=False).aggregate({'session_value': 'mean'}).rename(columns={'session_value': 'mean_session_value'})
mean_session_value_data

  group  mean_session_value
0     A                 0.8
1     B                 0.8